# FamilyInstanceCreationData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyInstanceCreationData Properties
FamilyInstanceCreationData Class See Also
---
The FamilyInstanceCreationData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Axis | Get or set the axis of the FamilyInstance |
| RotateAngle | Get or set the rotate angle of the FamilyInstance |

# See Also
FamilyInstanceCreationData Class
Autodesk.Revit.Creation Namespace